{
  "generatedAt": "2025-09-11T22:33:01.152Z",
  "date": "September 11, 2025",
  "stories": [
    {
      "id": "b0a085b5-1009-475a-99f1-2d851a038748",
      "title": "UKRAINE REPORTS CONTINUED MISSILE ATTACKS TARGETING ZHYTOMYR AND WESTERN REGIONS",
      "location": "Kyiv",
      "content": "Ukraine's Air Force reported continued Russian cruise missile activity targeting Zhytomyr and western regions between 3:15 AM and 3:30 AM UTC on September 10th, 2025. Reports indicated missiles heading towards Zhytomyr, Ivano-Frankivsk, and Ternopil regions, with local media reporting smoke after ex...",
      "body": "Ukraine's Air Force reported continued Russian cruise missile activity targeting Zhytomyr and western regions between 3:15 AM and 3:30 AM UTC on September 10th, 2025. Reports indicated missiles heading towards Zhytomyr, Ivano-Frankivsk, and Ternopil regions, with local media reporting smoke after explosions in Zhytomyr.\n\nDuring this 15-minute window, \"monitor\" reported one group of cruise missiles on a trajectory towards Vinnytsia. The Ukrainian Air Force and \"monitor\" also tracked multiple groups of cruise missiles in the Ternopil region heading west towards Ivano-Frankivsk. \"먫쮏쒬뒗얧쥃 햒햨햟혱햫햦\" reported rockets targeting Zhytomyr from the south and in the center of Khmelnytskyi region with a southwestern course.\n\nThe Polish National Security Bureau stated that President Karol Nawrocki is being kept informed of airspace violations by Russian drones throughout the night. \"We ask you to follow the announcements and rely on information coming from the strategic commands of the Polish Armed Forces and services,\" the Bureau stated, expressing gratitude to those protecting Polish skies and urging calm. Meanwhile, \"먫쮏쒬뒗얧쥃 햒햨햟혱햫햦\" reported \"Last 2 over Zhytomyr\" and \"There are 4, there is a combat work,\" indicating ongoing engagement with incoming threats.",
      "category": "conflict",
      "emoji": "游댮",
      "color": "#ef4444",
      "channelId": "1108893038757036052",
      "channelName": "游댮丘멆잺ukraine-russia-live",
      "messageCount": 29,
      "availableImages": [],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-10T03:30:25.723Z"
    },
    {
      "id": "2dfc2141-1186-4e66-b807-a7c043d987b3",
      "title": "CHARLIE KIRK ASSASSINATION CONTINUES TO SHAPE CONGRESSIONAL ATMOSPHERE; POPULATION GROWTH FORECAST REVISED",
      "location": "Washington",
      "content": "Lawmakers are reportedly fearful for their safety following the assassination of Charlie Kirk, with some changing their behavior by canceling events or carrying firearms, according to NBC News reporting on September 11th, 2025. This heightened concern for security is occurring as the U.S. Coast Guar...",
      "body": "Lawmakers are reportedly fearful for their safety following the assassination of Charlie Kirk, with some changing their behavior by canceling events or carrying firearms, according to NBC News reporting on September 11th, 2025. This heightened concern for security is occurring as the U.S. Coast Guard continues its investigation into inappropriate social media activity by a member. Separately, the U.S. population growth is forecast to slow further, with deaths expected to exceed births in 2031, two years earlier than previously projected, according to the Congressional Budget Office (CBO).\n\nConcerns over safety in Congress have led to tangible changes in lawmaker conduct, with reports indicating a palpable sense of fear. This atmosphere is compounded by the ongoing U.S. Coast Guard investigation into personnel's social media activity, which the agency stated is contrary to core values, as confirmed via a statement released on X. The investigation is supported by the Department of Homeland Security. Meanwhile, the U.S. deficit for August was $345 billion, with $29.5 billion collected in tariffs, according to data cited by Jamie Dupree on X. The total deficit for fiscal year 2025 is $1.973 trillion, an increase from the same point in 2024.\n\nIn legislative matters, Republican leaders are considering a House vote next week on a stopgap spending bill to extend government funding through November 20. The Senate may vote on this measure late next week, according to Politico. Senate Democrats attempted to hotline a proposal to delay a procedural vote on a GOP rules change until Monday, but this request was rejected by Republicans, as reported by Andrew Desiderio on X. Separately, the Trump administration has requested an appeals court to re-fire Lisa Cook before an upcoming Federal Reserve board meeting, as reported by Kyle Cheney.\n\nIn military news, the second B-21 Raider aircraft has completed its first flight, accelerating the test campaign for mission system and weapons evaluations, according to the Secretary of the Air Force's official X account. In New Jersey, a National Research poll conducted between September 8th and September 10th shows Mikie Sherrill leading Jack Ciattarelli 47% to 45% in the gubernatorial race, according to PollTracker2024 on X. Representative Morgan Luttrell, a Republican from Texas, announced he will not seek re-election, with reports suggesting his decision may be due to dissatisfaction with his time in Congress.\n\nThe Department of Justice reported a water disruption at Naval Station Guantanamo Bay led to the relocation of three \"low-threat aliens.\" Representative Don Bacon stated that firmness towards Russia is necessary, advocating for military aid to Ukraine and secondary sanctions against Russia. In a separate development, a bipartisan deal in the Senate regarding a legislative matter faced challenges due to a lack of unanimous consent to proceed today, with Senator Lankford expressing doubts about sufficient trust to punt the issue to the following week. U.S. lawmakers completed a trip to Burkina Faso last month, marking their first successful visit in three years due to previous political instability and violence in the Sahel region.",
      "category": "politics",
      "emoji": "游리",
      "color": "#fbbf24",
      "channelId": "1312302264203087963",
      "channelName": "游리us-politics-live",
      "messageCount": 13,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1312302264203087963/1415788890077270067/juiceboxed..jpg?ex=68c47ba7&is=68c32a27&hm=235b7e37e31273ea951a462a2100946504d9f426b4137864a989df22dd2500ca&",
          "filename": "juiceboxed..jpg",
          "width": 1035,
          "height": 665,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415788889683132468",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1312302264203087963/1415788023748104212/juiceboxed..png?ex=68c47ad8&is=68c32958&hm=cb21ab2446e149d5324087cc971daadd5f8a2b6e8ed408d7ef31749aa150e302&",
          "filename": "juiceboxed..png",
          "width": 583,
          "height": 598,
          "description": "Image from FaytuksBot: juiceboxed..png",
          "messageId": "1415788023190392966",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1312302264203087963/1415787837726392320/juiceboxed..jpg?ex=68c47aac&is=68c3292c&hm=5cb884afe79a3bf255227245a00fe2a95ca4a247430b9bdf9e692e3337139f20&",
          "filename": "juiceboxed..jpg",
          "width": 1100,
          "height": 1132,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415787837227536388",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-11T20:01:13.781Z"
    },
    {
      "id": "60b070e4-9e2a-4e24-be90-fb8697e3d194",
      "title": "ISRAELI AIR FORCE STRIKES YEMENI CAPITAL SANA'A",
      "location": "Sana'a",
      "content": "The Israeli Air Force conducted a wave of airstrikes on Yemen's capital, Sana'a, beginning around 1:47 PM UTC on September 10, 2025. The strikes targeted multiple locations within the city, including Al-Qiyada Street, Wahda, and Fajj Attan, as well as a defense complex in the Al-Ardi neighborhood. A...",
      "body": "The Israeli Air Force conducted a wave of airstrikes on Yemen's capital, Sana'a, beginning around 1:47 PM UTC on September 10, 2025. The strikes targeted multiple locations within the city, including Al-Qiyada Street, Wahda, and Fajj Attan, as well as a defense complex in the Al-Ardi neighborhood. Arab sources reported that six Houthi targets were attacked. These actions are described as retaliatory operations against the Houthis.\n\nExplosions were observed and reported by witnesses in the affected areas. Unverified photos of the aftermath have been circulating on social media platforms. Reports also indicate Israeli activity in Amran County, northwest of Sana'a, with the Houthi-affiliated Al-Masra channel reporting \"Israeli aggression in the capital of Sana'a.\"\n\nThese airstrikes occurred within a 15-minute window, from approximately 1:47 PM to 2:02 PM UTC on September 10, 2025. The specific nature of the targets and any potential casualties or damage were not immediately confirmed by official Israeli or Houthi sources at the time of reporting.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1258942836296912916",
      "channelName": "游말ran-axis-live",
      "messageCount": 9,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1258942836296912916/1415336000577867856/maverick_1986.jpg?ex=68c2d5de&is=68c1845e&hm=46fdefd1cae07e91c175823547488fa0694a94d7119d54de31fd3b84eb5e204f&",
          "filename": "maverick_1986.jpg",
          "width": 720,
          "height": 1280,
          "description": "Image from FaytuksBot: maverick_1986.jpg",
          "messageId": "1415336000229605508",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1258942836296912916/1415335668242190367/hulodop.jpg?ex=68c2d58e&is=68c1840e&hm=23f93b17fd943593bad0ff5e78fdae7e4281f4add3abdb0323b8a5c1bdcc0ad7&",
          "filename": "hulodop.jpg",
          "width": 1280,
          "height": 720,
          "description": "Image from FaytuksBot: hulodop.jpg",
          "messageId": "1415335667826692098",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1258942836296912916/1415335364037709886/mirtrick.jpg?ex=68c2d546&is=68c183c6&hm=addc8e1457b7d7537d3bd631dd78756c6fd3c6446f758aaea07efcc277ae6d5a&",
          "filename": "mirtrick.jpg",
          "width": 597,
          "height": 1280,
          "description": "Image from FaytuksBot: mirtrick.jpg",
          "messageId": "1415335363752362089",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-10T14:02:06.312Z"
    },
    {
      "id": "ce15a174-1f1b-495f-a3fb-b4859d236e34",
      "title": "MAJOR EXPLOSION ROCKS MARACAIBO INDUSTRIAL ZONE",
      "location": "Maracaibo",
      "content": "A powerful explosion occurred in the industrial zone of Maracaibo, Venezuela, around 1:45 PM UTC on September 11th, 2025, causing significant destruction and tremors felt across kilometers. The blast is attributed to a gas truck that was reportedly downloading at a filling station. This incident fol...",
      "body": "A powerful explosion occurred in the industrial zone of Maracaibo, Venezuela, around 1:45 PM UTC on September 11th, 2025, causing significant destruction and tremors felt across kilometers. The blast is attributed to a gas truck that was reportedly downloading at a filling station. This incident follows a period of heightened international scrutiny for Venezuela after the European Parliament designated the \"Los Soles poster\" as a terrorist organization earlier on September 11th.\n\nReports from social media indicate the explosion was heard for kilometers, with walls and roofs rumbling from the force of the blast. The \"bicolor hardware store\" in San Francisco, Maracaibo, is presumed to be affected. Several social media posts described the event as \"horrible\" and \"tremendous.\"\n\nWhile the immediate cause is linked to a gas truck at a filling station, the timing of this significant explosion occurs on the same day the European Parliament added the \"Los Soles poster\" and a Colombian narco figure to the EU's list of terrorist organizations. Diosdado Cabello, a Venezuelan official, issued a warning about potential repercussions for any actions taken against Venezuela. Earlier in the day, a U.S. Air Force KC-135R Stratotanker was observed flying over the Caribbean Sea northwest of Maiquet칤a, Venezuela.",
      "category": "military",
      "emoji": "游리",
      "color": "#fbbf24",
      "channelId": "1267605088000802928",
      "channelName": "游맛s-venezuela",
      "messageCount": 7,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1267605088000802928/1415698480730603682/juiceboxed..jpg?ex=68c42774&is=68c2d5f4&hm=19940fc65b4c12a27ee4e3b4eda7d60fdcddef73a5585c33f9533a7a2dd8860b&",
          "filename": "juiceboxed..jpg",
          "width": 540,
          "height": 960,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415698480411840532",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1267605088000802928/1415697471191126147/juiceboxed..jpg?ex=68c42683&is=68c2d503&hm=11ca46fe8d7f903af6dd744143f10d2cebaf6b6b460f228adaf43db6bcdf3ee6&",
          "filename": "juiceboxed..jpg",
          "width": 750,
          "height": 1000,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415697469987356813",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1267605088000802928/1415697024158011574/juiceboxed..jpg?ex=68c42618&is=68c2d498&hm=b38b706a611bb7ede9366976bda3585e218197eeca95c7546fa92fdbac784a95&",
          "filename": "juiceboxed..jpg",
          "width": 1152,
          "height": 2048,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415697023168024740",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1267605088000802928/1415696780410093610/juiceboxed..jpg?ex=68c425de&is=68c2d45e&hm=9cddc8afb70d9eec78e9c7f253da41588ab76173acb3608d6533cfef59e33784&",
          "filename": "juiceboxed..jpg",
          "width": 1536,
          "height": 2048,
          "description": "Image from FaytuksBot: juiceboxed..jpg",
          "messageId": "1415696779965370481",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-11T14:01:04.173Z"
    },
    {
      "id": "d0a39c87-02a6-4253-a223-2742d86b8ae4",
      "title": "MEXICAN AUTHORITIES ANNOUNCE MAJOR DRUG AND FUEL THEFT INTERVENTIONS",
      "location": "Mexico City",
      "content": "Mexican authorities announced a series of significant law enforcement actions across the country, including the destruction of a large marijuana cultivation site and the apprehension of individuals involved in fuel theft, as reported between August 25 and September 10.\n\nIn Sonora, the Mexican Army a...",
      "body": "Mexican authorities announced a series of significant law enforcement actions across the country, including the destruction of a large marijuana cultivation site and the apprehension of individuals involved in fuel theft, as reported between August 25 and September 10.\n\nIn Sonora, the Mexican Army and the SSP destroyed a marijuana cultivation operation covering over 8,300 square meters, with plants occupying 1,189 square meters in Cananea, according toforo_militar. Separately, the Secretariat of the Navy reported the death of Captain Adri치n Omar del 츼ngel Z칰침iga during an alleged accident at a shooting practice in Puerto Pe침asco, Sonora.\n\nIntelligence reports suggest a crackdown on fuel theft is impacting businessmen in Tamaulipas, specifically in Tampico, Reynosa, and Matamoros, with partners of Roberto Blanco Cant칰, also known as \"The Lord of Ships\" or \"Roberto Brown,\" reportedly facing consequences, as stated by FuriaNegra77.\n\nIn a broader context, a U.S. Drug Enforcement Administration (DEA) operation targeting the Sinaloa Cartel between August 25 and August 29 resulted in 617 arrests and the seizure of 10.2 tons of drugs, including 480 kg of fentanyl, 714,707 counterfeit pills, 2.2 tons of methamphetamine, 7.5 tons of cocaine, and 16.5 kg of heroin. This international effort, involving 23 U.S. field divisions and seven foreign regions, also led to the seizure of $12.8 million in currency and assets, and 420 firearms, according to WorldCrimeIntel.\n\nThe focus of the DEA operation was to dismantle the cartel's command, control, and distribution networks, aligning with broader U.S. governmental efforts following the cartel's designation as an international terrorist organization. The crackdown on fuel theft in Mexico has been highlighted by AP, with critics noting it underscores the depth of the problem, and this comes shortly after U.S. Secretary of State Marco Rubio visited Mexico to discuss security matters.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1109167145239187477",
      "channelName": "游리mexico",
      "messageCount": 6,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1109167145239187477/1415211471519879349/luris..jpg?ex=68c261e4&is=68c11064&hm=1ae9c79756ceff7b660505c57a681ada412d883d9a593b947ad44d108818ee85&",
          "filename": "luris..jpg",
          "width": 1356,
          "height": 725,
          "description": "Image from FaytuksBot: luris..jpg",
          "messageId": "1415211470974877699",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109167145239187477/1415211248970240071/luris..jpg?ex=68c261af&is=68c1102f&hm=48e4a91c94a47b39bc0538b68394ca1ad9efc751b559934fa9a417fc58480db5&",
          "filename": "luris..jpg",
          "width": 600,
          "height": 450,
          "description": "Image from FaytuksBot: luris..jpg",
          "messageId": "1415211248777429023",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109167145239187477/1415211122801508456/luris..jpg?ex=68c26191&is=68c11011&hm=9082d6a1530fd51966db565139060b0f7f0ad4ebf409e1b21be2587cc4827b15&",
          "filename": "luris..jpg",
          "width": 1284,
          "height": 1536,
          "description": "Image from FaytuksBot: luris..jpg",
          "messageId": "1415211122382082102",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109167145239187477/1415211009068503061/luris..jpg?ex=68c26175&is=68c10ff5&hm=6cb7c88712cee0968ae8590ca2d37bfa77cb2178b08a030b086bcf05ccd35a2f&",
          "filename": "luris..jpg",
          "width": 1012,
          "height": 675,
          "description": "Image from FaytuksBot: luris..jpg",
          "messageId": "1415211008670306327",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109167145239187477/1415210481672519732/luris..jpg?ex=68c260f8&is=68c10f78&hm=fee963e8ac1d8041dc1b10849160ab17f86a35303c238a60e884463d8ab78908&",
          "filename": "luris..jpg",
          "width": 1080,
          "height": 1350,
          "description": "Image from FaytuksBot: luris..jpg",
          "messageId": "1415210481383374960",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-10T05:46:00.533Z"
    },
    {
      "id": "05629b0b-b6ea-41a4-a0ae-d04894750aa4",
      "title": "NETANYAHU ATTENDS MA'ALE ADUMIM CEREMONY AS HAMAS COMMANDER KILLED",
      "location": "Ma'ale Adumim",
      "content": "Prime Minister Benjamin Netanyahu attended a roof signing ceremony in Ma'ale Adumim earlier today, September 11th, 2025, as reported by the Israeli Prime Minister's Hebrew social media account. Meanwhile, the Abu Ali Mustafa Brigades announced the death of their commander, Mamdouh Awni Ismail Bakr, ...",
      "body": "Prime Minister Benjamin Netanyahu attended a roof signing ceremony in Ma'ale Adumim earlier today, September 11th, 2025, as reported by the Israeli Prime Minister's Hebrew social media account. Meanwhile, the Abu Ali Mustafa Brigades announced the death of their commander, Mamdouh Awni Ismail Bakr, who was killed in an \"unfortunate accident\" last week. Bakr reportedly oversaw all operations in the Gaza Strip during the October 7 attacks.\n\nThe Israeli military published details of the 162nd Division's operations in Jabalia and Sheikh Radwan. This follows IDF reports from the previous window (September 11th, 2025, 3:17 PM UTC to 4:16 PM UTC) detailing the destruction of Hamas sites, including tunnels and weapon depots, and the killing of dozens of operatives in these areas. Hamas's Qassam Brigades had claimed to have destroyed an Israeli Merkava tank and killed at least four Israeli soldiers near Jabalia during that period.\n\nIn related news from the previous reporting window (September 11th, 2025, 2:32 PM UTC to 3:17 PM UTC), Hamas leaders reportedly did not attend a funeral in Doha for victims of an alleged Israeli airstrike. One source noted the absence of key Hamas political bureau officials, including Khalil Al-Hayya, from the funeral for security elements and an office director of the Hamas political bureau president, along with a Qatari policeman.\n\nEarlier on September 11th, 2025, reports indicated Gazans were criticizing Hamas for alleged child brainwashing and demanding education for peace, according to social media posts. Additionally, changes were noted in downtown Gaza, including the removal of tents due to evacuations. Previous reports also detailed allegations that Hamas was firing on civilians attempting to move west of Khan Yunis.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1108929874997039144",
      "channelName": "游댮israel-palestine-live",
      "messageCount": 5,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1108929874997039144/1415738539651366964/biue6292.jpg?ex=68c44cc3&is=68c2fb43&hm=b8e2e740525f610487439ce99ddef2c02e4f7c4d235aaf2271b8ea25e6fce746&",
          "filename": "biue6292.jpg",
          "width": 1080,
          "height": 629,
          "description": "Image from FaytuksBot: biue6292.jpg",
          "messageId": "1415738539353833494",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1108929874997039144/1415736333179293707/akneehow.jpg?ex=68c44ab4&is=68c2f934&hm=39f6359904adce1b0540088baac184b9a517fd5ae7a73def9d472d0f950da3da&",
          "filename": "akneehow.jpg",
          "width": 914,
          "height": 1280,
          "description": "Image from FaytuksBot: akneehow.jpg",
          "messageId": "1415736332788961331",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1108929874997039144/1415733876919242772/biue6292.jpg?ex=68c4486b&is=68c2f6eb&hm=6d95dad35081421f20f38c74681757f23fae04546fe4665f565c8dc3a2982311&",
          "filename": "biue6292.jpg",
          "width": 1280,
          "height": 1124,
          "description": "Image from FaytuksBot: biue6292.jpg",
          "messageId": "1415733875463684303",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-11T16:48:13.982Z"
    },
    {
      "id": "c6d111c7-4666-475f-b5f4-c7d74c6d17b7",
      "title": "52 BELARUSIAN POLITICAL PRISONERS ARRIVE IN VILNIUS AMIDST ONGOING REPRESSION",
      "location": "Vilnius",
      "content": "Fifty-two Belarusian political prisoners, including six Lithuanians, arrived in Vilnius, Lithuania, between 5:02 PM and 5:19 PM UTC on September 11th, following their release from Belarusian detention. The group was met with supportive crowds and proceeded to the U.S. Embassy in Vilnius, according t...",
      "body": "Fifty-two Belarusian political prisoners, including six Lithuanians, arrived in Vilnius, Lithuania, between 5:02 PM and 5:19 PM UTC on September 11th, following their release from Belarusian detention. The group was met with supportive crowds and proceeded to the U.S. Embassy in Vilnius, according to reports from Nasha Niva and BelSAT. This event occurs as human rights defenders report eight additional individuals have been added to the list of political prisoners in Belarus.\n\nAn associate of Nikolai Statkevich, one of the released individuals, stated that Statkevich is strong and wishes to remain with his people, indicating a potential refusal to leave Belarus, as suggested by Zerkalo.io in previous reporting. Statkevich's associate, Yevgeny Vilsky, reportedly had a brief conversation with him in the neutral zone, stating that Statkevich wants to be free from Lukashenko's power and with his people.\n\nLithuanian President Gitanas Naus캥da previously expressed gratitude for the release, thanking the United States and President Donald Trump. However, a statement from Sviatlana Tsikhanouskaya on X emphasized that true freedom involves no deportations or exile and that Belarusians must be safe in their own country, with all repression ending. BelSAT reported that the former political prisoners were transported in cars with diplomatic plates directly into the U.S. Embassy.\n\nIn parallel, a new poll from September 1st-6th shows the PSOE-S&D party leading in Spain with 33% support. This information was released on September 11th, with fieldwork conducted by EuropeElects.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1109236942765310072",
      "channelName": "游댯continental-europe",
      "messageCount": 4,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747717577314355/5b17900cc169fd18.jpg?ex=68c4554f&is=68c303cf&hm=6e05e178cf2701390499327f06c2e46e3de3389c74153b1fc0e4b447e787770e&",
          "filename": "5b17900cc169fd18.jpg",
          "width": 732,
          "height": 595,
          "description": "Image from FaytuksBot: 5b17900cc169fd18.jpg",
          "messageId": "1415747717157879819",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747391423774760/c6f95abe8e0cb5c5.jpg?ex=68c45501&is=68c30381&hm=c72f9611aa6408bf4b9904321c9805bec01a63c24e3eba15c13151a70356f0d0&",
          "filename": "c6f95abe8e0cb5c5.jpg",
          "width": 800,
          "height": 533,
          "description": "Image from FaytuksBot: c6f95abe8e0cb5c5.jpg",
          "messageId": "1415747391075778577",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747391692214282/b305f604bae2484f.jpg?ex=68c45501&is=68c30381&hm=a9dbc58a0c91cf19d8ab15cb91b90dd7fb9ea37ed00d3fe078fdd52d6aca25fd&",
          "filename": "b305f604bae2484f.jpg",
          "width": 800,
          "height": 533,
          "description": "Image from FaytuksBot: b305f604bae2484f.jpg",
          "messageId": "1415747391075778577",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747391969296384/950910a1971b46b5.jpg?ex=68c45501&is=68c30381&hm=3cff26dee5a90022d7c554881e46b1b5fea230d16afad8d9ee88ec5f5ec6b7b4&",
          "filename": "950910a1971b46b5.jpg",
          "width": 800,
          "height": 533,
          "description": "Image from FaytuksBot: 950910a1971b46b5.jpg",
          "messageId": "1415747391075778577",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747392203915314/7391893631d8ede8.jpg?ex=68c45501&is=68c30381&hm=32216ab5aa690237b0ae35aed233fc3ab6b5827565b20994b8d4aa708833ffd9&",
          "filename": "7391893631d8ede8.jpg",
          "width": 800,
          "height": 533,
          "description": "Image from FaytuksBot: 7391893631d8ede8.jpg",
          "messageId": "1415747391075778577",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747392535400532/f9698f6de5ed2fa4.jpg?ex=68c45501&is=68c30381&hm=1168c1e4e638d23548e61f381acf353bf5ce8cda5dc1f5640ab3ed11c7f6829c&",
          "filename": "f9698f6de5ed2fa4.jpg",
          "width": 800,
          "height": 533,
          "description": "Image from FaytuksBot: f9698f6de5ed2fa4.jpg",
          "messageId": "1415747391075778577",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415747073957167184/stenkkav.jpg?ex=68c454b5&is=68c30335&hm=a1b3c4389443c75f0bd97109a891d12ed9d941bafb68cb9ebe29428825ec26a4&",
          "filename": "stenkkav.jpg",
          "width": 808,
          "height": 539,
          "description": "Image from FaytuksBot: stenkkav.jpg",
          "messageId": "1415747073457787032",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1109236942765310072/1415744799146774639/anzeeeeee.jpg?ex=68c45297&is=68c30117&hm=473a1a814c9a313907f5716d4cda82317cfc91e8d3edd480267292aca4a9aa6a&",
          "filename": "anzeeeeee.jpg",
          "width": 1215,
          "height": 700,
          "description": "Image from FaytuksBot: anzeeeeee.jpg",
          "messageId": "1415744798610165853",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-11T17:19:22.907Z"
    },
    {
      "id": "2eae64f3-43a1-4378-b3cf-895034679ace",
      "title": "MYANMAR JUNTA FLEET STRIKES KILL 16 CIVILIANS DURING RETURN TO MANDALAY",
      "location": "Mandalay",
      "content": "Sixteen civilians were killed by airstrikes and shelling on September 11th, 2025, as a Myanmar junta fleet traveled from Bhamo in southern Kachin State back to Mandalay. The strikes were reportedly used to provide cover for the returning flotilla.\n\nThe incident occurred during the fleet's journey do...",
      "body": "Sixteen civilians were killed by airstrikes and shelling on September 11th, 2025, as a Myanmar junta fleet traveled from Bhamo in southern Kachin State back to Mandalay. The strikes were reportedly used to provide cover for the returning flotilla.\n\nThe incident occurred during the fleet's journey down the Ayeyarwady River. The Myanmar junta has been increasingly employing airstrikes and shelling in its operations, according to a report by Myanmar Now.\n\nIn a separate development, approximately 30,000 more people have been displaced in Karenni State during 2025, significantly escalating humanitarian needs in the region, according to Kantarawaddy Times.\n\nAdditionally, there are increasing reports of a military build-up near Khaunglanhpu, with local populations reportedly being forced to serve as porters for the army, as indicated by Kachin News.\n\nMeanwhile, an official from Myanmar's election commission, speaking anonymously on Thursday, stated that results of the junta-organized election are expected by the end of January. The commission confirmed that six parties will compete for national office in the upcoming election.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1174030918126682183",
      "channelName": "游맔yanmar",
      "messageCount": 4,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1174030918126682183/1415667197300445345/antilleanfeline.png?ex=68c40a51&is=68c2b8d1&hm=91dc33979255b5d1aef4e419f8e2f3be6741f5bc06709cf6295292ad203de346&",
          "filename": "antilleanfeline.png",
          "width": 493,
          "height": 467,
          "description": "Image from FaytuksBot: antilleanfeline.png",
          "messageId": "1415667196998189228",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1174030918126682183/1415666862527873056/antilleanfeline.jpg?ex=68c40a01&is=68c2b881&hm=33c59ec33b02464bb77fe1ec89544df2c7721f16336a5fc6fd9c8227d1f75084&",
          "filename": "antilleanfeline.jpg",
          "width": 800,
          "height": 800,
          "description": "Image from FaytuksBot: antilleanfeline.jpg",
          "messageId": "1415666862254981221",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-11T12:01:54.296Z"
    },
    {
      "id": "f2158f25-6978-4ba6-9de1-1150fe1cbd8b",
      "title": "SUDANESE AIR FORCE STRIKES RSF POSITIONS IN NYALA AND SOUTH KORDOFAN AMID ESCALATING CLASHES",
      "location": "Khartoum",
      "content": "The Sudanese Air Force conducted air strikes on Rapid Support Forces (RSF) positions in Nyala and east of Deling in South Kordofan yesterday, according to multiple reports.\n\nThese actions follow an intensification of RSF attacks on civilian infrastructure in Sudan, including coordinated strikes usin...",
      "body": "The Sudanese Air Force conducted air strikes on Rapid Support Forces (RSF) positions in Nyala and east of Deling in South Kordofan yesterday, according to multiple reports.\n\nThese actions follow an intensification of RSF attacks on civilian infrastructure in Sudan, including coordinated strikes using UAE-supplied suicide drones on three major electricity substations in Khartoum and Omdurman yesterday, as reported by AfriMEOSINT. These drone attacks have further deepened the humanitarian crisis in the country.\n\nVistaMaps also reported that the Sudanese armed forces carried out a qualitative operation yesterday, targeting the RSF east of the city of Deling in South Kordofan. The Sudanese Air Force's strikes in Nyala were also confirmed by Sudan War Updates.\n\nThe ongoing conflict has led to a severe humanitarian crisis, exacerbated by attacks on essential infrastructure.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1108890119013925008",
      "channelName": "游맙udan",
      "messageCount": 3,
      "availableImages": [
        {
          "url": "https://cdn.discordapp.com/attachments/1108890119013925008/1415353512312836147/stenkkav.jpg?ex=68c2e62d&is=68c194ad&hm=0662bedc009691b19d0b17ec6cac5a568ea222b91805489e62205666a504b92b&",
          "filename": "stenkkav.jpg",
          "width": 2048,
          "height": 1346,
          "description": "Image from FaytuksBot: stenkkav.jpg",
          "messageId": "1415353511964840061",
          "author": "FaytuksBot"
        },
        {
          "url": "https://cdn.discordapp.com/attachments/1108890119013925008/1415353470919245834/stenkkav.jpg?ex=68c2e623&is=68c194a3&hm=920b6f45fea67cb9dc7901bd6c9bb651ce8067bdd387dd2eee1fd17a264b3989&",
          "filename": "stenkkav.jpg",
          "width": 3438,
          "height": 2463,
          "description": "Image from FaytuksBot: stenkkav.jpg",
          "messageId": "1415353470264938548",
          "author": "FaytuksBot"
        }
      ],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-10T15:18:08.116Z"
    },
    {
      "id": "1ac5d8b3-d550-4fc7-9347-fde786fb963e",
      "title": "SYRIAN DEMOCRATIC FORCES REPEL DAMASCUS-AFFILIATED GROUP ATTACKS IN DEIR HAFER",
      "location": "Deir Hafer",
      "content": "Syrian Democratic Forces (SDF) reported repelling infiltration and artillery attack attempts by groups affiliated with the Damascus government in the Deir Hafer area between 9:30 PM and 10:00 PM UTC on September 10th, 2025. The SDF stated on their official X account that these attempts fully failed ...",
      "body": "Syrian Democratic Forces (SDF) reported repelling infiltration and artillery attack attempts by groups affiliated with the Damascus government in the Deir Hafer area between 9:30 PM and 10:00 PM UTC on September 10th, 2025. The SDF stated on their official X account that these attempts fully failed and asserted that the Damascus government bears full responsibility for the escalation.\n\nAccording to the SDF statement released within the reporting window, their forces \"firmly confronted the attempts to infiltrate and attack the artillery assaulted by unpleasant groups belonging to the Damascus government in the Deir Hafer area, and these attempts fully failed.\" The statement also asserted that the initiating party of the escalation through repeated violations threatens regional stability.\n\nEarlier in the reporting window, between 8:47 PM and 9:30 PM UTC on September 10th, 2025, the SDF announced that 18 members of groups affiliated with the Turkish state were killed or wounded in clashes in Deir Hafer. The SDF stated that wounded combatants were being transported to Manbij, and that Turkish state UVACs were observed flying over the Tishrin, Deir Hafer, and Maskanah regions during this period. The SDF had attributed these earlier clashes to response to drone attacks targeting the village of Habuba, which they also attributed to groups affiliated with the Turkish state.\n\nIn separate reporting, Syrian Government Forces launched further attacks against SDF positions at the Tishreen dam frontline. The SDF responded to these attacks along the Tishreen frontline in Deir Hafer as clashes intensified, reportedly intercepting drones launched by Syrian Government forces. Separately, a social media post on September 10th, 2025, noted that the new Syrian army marching with a Taliban flag is not shocking, referencing a 2021 HTS parade and celebration in Idlib when Afghanistan fell to the Taliban.",
      "category": "news",
      "emoji": "游닗",
      "color": "#6b7280",
      "channelId": "1108908716629184593",
      "channelName": "游맙yria",
      "messageCount": 3,
      "availableImages": [],
      "timeframe": "dynamic",
      "generatedAt": "2025-09-10T22:30:44.789Z"
    }
  ]
}